/********************************************************************************
 *                               libemu
 *
 *                    - x86 shellcode emulation -
 *
 *
 * Copyright (C) 2007  Paul Baecher & Markus Koetter
 * 
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 * 
 * 
 *             contact nepenthesdev@users.sourceforge.net  
 *
 *******************************************************************************/

#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <stddef.h>

#include "emu.h"
#include "emu_cpu.h"
#include "emu_memory.h"
extern "C"{
	#include "emu_hashtable.h"
}
#include "emu_env.h"
#include "emu_env_w32.h"
#include "emu_env_w32_dll.h"
#include "emu_env_w32_dll_export.h"
#include "env_w32_dll_export_hooks.h"
#include "emu_log.h"

#pragma warning (disable:4311)

extern const char kernel32_dll_7c800000[];
extern const char kernel32_dll_7c801000[];
extern const char ws2_32_71a10000[];
extern const char ws2_32_71a11000[];
extern const char msvcrt_77be0000[];
extern const char msvcrt_77C28970[];
extern const char urlmon_7DF20000[];
extern const char urlmon_7DF21000[];

// added -dzzie 
extern const char user32_7E410000[];  /* pe header and section table */
extern const char user32_7e413900[];  /* export table */
extern const char shell32_7C9C0000[]; /* pe header and section table */
extern const char shell32_7c9e7d50[]; /* export table */
extern const char wininet_3D930000[]; /* pe header and section table 2-2-11*/
extern const char wininet_3d931844[]; /* export table */
extern const char ntdll_7C900000[]; /* pe header and section table 2-5-11*/
extern const char ntdll_7c903400[]; /* export table */
extern const char shlwapi_77F60000[]; /* pe header and section table 3-10-11*/
extern const char shlwapi_77f61820[]; /* export table */
extern const char advapi32_77DD0000[];
extern const char advapi32_77dd16A4[];
extern const char shdocvw_7E290000[];
extern const char shdocvw_7E2A4480[];



struct emu_env_w32_known_dll_segment kernel32_segments[] = 
{
	{0x7c800000,kernel32_dll_7c800000,641},
	{0x7c801000,kernel32_dll_7c801000,32625},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment ws2_32_segments[] = 
{
	{
		0x71a10000,
		ws2_32_71a10000,
		786,
	},
	{
		0x71a11000,
		ws2_32_71a11000,
		5634,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment msvcrt_segments[] = 
{
	{
		0x77be0000,
		msvcrt_77be0000,
		5634,
	},
	{
		0x77C28970,
		msvcrt_77C28970,
		17328,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment urlmon_segments[] = 
{
	{
		0x7DF20000,
		urlmon_7DF20000,
		786,
	},
	{
		0x7DF21000,
		urlmon_7DF21000,
		6144,
	},
	{ 0, NULL, 0 }
};

//dzzie 1-26-11
struct emu_env_w32_known_dll_segment user32_segments[] = 
{
	{
		0x7E410000,
		user32_7E410000,
		0x2cf,
	},
	{
		0x7e413900,
		user32_7e413900,
		0x4baf,
	},
	{ 0, NULL, 0 }
};

//dzzie 1-26-11
struct emu_env_w32_known_dll_segment shell32_segments[] = 
{
	{
		 0x7C9C0000,
		shell32_7C9C0000,
		0x28f,
	},
	{
		 0x7c9e7d50,
		shell32_7c9e7d50,
		0x291f,
	},
	{ 0, NULL, 0 }
};

//dzzie 2-2-11
struct emu_env_w32_known_dll_segment wininet_segments[] = 
{
	{
		 0x3D930000,
		wininet_3D930000,
		0x2Af,
	},
	{
		 0x3d931844,
		wininet_3d931844,
		0x1d4f,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment ntdll_segments[] = 
{
	{
		 0x7C900000,
		ntdll_7C900000,
		0x27f,
	},
	{
		 0x7c903400,
		ntdll_7c903400,
		0x9a5f,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment shlwapi_segments[] = 
{
	{
		 0x77F60000,
		shlwapi_77F60000,
		0x39f,
	},
	{
		 0x77f61820,
		shlwapi_77f61820,
		0x27ff,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment advapi32_segments[] = 
{
	{
		 0x77DD0000,
		advapi32_77DD0000,
		0x31f,
	},
	{
		 0x77dd16A4,
		advapi32_77dd16A4,
		0x5253,
	},
	{ 0, NULL, 0 }
};

struct emu_env_w32_known_dll_segment shdocvw_segments[] = 
{
	{
		 0x7E290000,
		shdocvw_7E290000,
		0x36f,
	},
	{
		 0x7E2A4480,
		shdocvw_7E2A4480,
		0x4e0,
	},
	{ 0, NULL, 0 }
};


struct emu_env_w32_known_dll known_dlls[] = 
{
	{ /* dummy entry for the PEB/LDR lists 
	   * shares base address with kernel32
	   * it should be possible to have this working without such
	   * hacks, but ... for now it works
	   */
		/*.dllname =*/ "process.exe",
		/*.baseaddress =*/ 0x7C800000,
		/*.imagesize =*/ 0xf6000, //0x00106000, -changed dz 
	}, 
	{
		/*.dllname =*/ "kernel32",      //this must always be first dll -dz
		/*.baseaddress =*/ 0x7C800000, 
		/*.imagesize =*/ 0xf6000, //0x00106000, //xpsp2 is only f600 and still same base this way no conflict with ntdll/*./*.not sure where org sz came from/*./*. dz
		/*.exports =*/ kernel32_exports, /* last export = lstrlenW - > 7c809a09 so were good */
		/*.memory_segments =*/ kernel32_segments,
	}, /* org end at 7C906000 - modded now ends at 7C80f6000 so no collision with ntdll) */
	{
		/*.dllname =*/ "ntdll", /* dzzie 2-5-11 */
		/*.baseaddress =*/ 0x7C900000, 
		/*.imagesize =*/ 0xB2000,
		/*.exports =*/ ntdll_exports,
		/*.memory_segments =*/ ntdll_segments,
	}, 
	{
		/*.dllname =*/ "ws2_32",
		/*.baseaddress =*/ 0x71A10000,
		/*.imagesize =*/ 0x17000,
		/*.exports =*/ ws2_32_exports,
		/*.memory_segments =*/ ws2_32_segments,
	},
	{
		/*.dllname =*/ "msvcrt",
		/*.baseaddress =*/ 0x77BE0000,
		/*.imagesize =*/ 0x58000,
		/*.exports =*/ msvcrt_exports,
		/*.memory_segments =*/ msvcrt_segments,
	},
	{
		/*.dllname =*/ "shell32", /* dzzie 1-26-11 */
		/*.baseaddress =*/ 0x7C9C0000,
		/*.imagesize =*/ 0x817000,
		/*.exports =*/ shell32_exports,
		/*.memory_segments =*/ shell32_segments,
	}, /*ends at 7D1D7000 */
	{
		/*.dllname =*/ "shdocvw", /* dzzie 3 12 11 */
		/*.baseaddress =*/ 0x7E290000,
		/*.imagesize =*/ 0x171000,
		/*.exports =*/ shdocvw_exports,
		/*.memory_segments =*/ shdocvw_segments,
	}, /*ends at 7E401000 */
	{
		/*.dllname =*/ "advapi32",
		/*.baseaddress =*/ 0x77DD0000,
		/*.imagesize =*/ 0x9B000,
		/*.exports =*/ advapi32_exports,
		/*.memory_segments =*/ advapi32_segments,
	}, /*ends at  77E6B000 export table data ends at 77DD68F6 3.12.11*/
	{
		/*.dllname =*/ "shlwapi", /* dzzie 3-10-11 */
		/*.baseaddress =*/ 0x77F60000, 
		/*.imagesize =*/ 0x76000,
		/*.exports =*/ shlwapi_exports,
		/*.memory_segments =*/ shlwapi_segments,
	},  
	{
		/*.dllname =*/ "urlmon",
		/*.baseaddress =*/ 0x7DF20000,
		/*.imagesize =*/ 0xA0000,
		/*.exports =*/ urlmon_exports,
		/*.memory_segments =*/ urlmon_segments,
	}, /*ends at 7DFC0000 */
	{
		/*.dllname =*/ "user32", /* dzzie 1-26-11 */
		/*.baseaddress =*/ 0x7E410000,
		/*.imagesize =*/ 0x00091000,
		/*.exports =*/ user32_exports,
		/*.memory_segments =*/ user32_segments,
	}, /*ends at 7E4A1000 */
	{
		/*.dllname =*/ "wininet", /* dzzie 2-2-11 */
		/*.baseaddress =*/ 0x3D930000,
		/*.imagesize =*/ 0xD1000,
		/*.exports =*/ wininet_exports,
		/*.memory_segments =*/ wininet_segments,
	},  
	{
		/*.dllname =*/ NULL,
		/*.baseaddress =*/ 0,
		/*.imagesize =*/ 0,
		/*.exports =*/ NULL,
		/*.memory_segments =*/ NULL,
	},

};

struct emu_env_w32 *emu_env_w32_new(struct emu *e)
{
	struct emu_env_w32 *env = (struct emu_env_w32 *)malloc(sizeof(struct emu_env_w32));
	memset(env,0,sizeof(struct emu_env_w32));
//	env->profile = emu_profile_new();
	env->emu = e;
	// write TEB and linklist

	struct emu_memory *mem = emu_memory_get(e);
	enum emu_segment oldseg = emu_memory_segment_get(mem);


//  0041709D   64:8B43 30       MOV EAX,DWORD PTR FS:[EBX+30]
//	7FFDF030  00 40 FD 7F                                      .@ý
//  7FFDE030  00 F0 FD 7F                                      .ðý


    emu_memory_segment_select(mem,s_fs);
	emu_memory_write_dword(mem,0x30,0x7ffdf000);
	emu_memory_segment_select(mem,oldseg);


//  004170A1   8B40 0C          MOV EAX,DWORD PTR DS:[EAX+C]
//  7FFDF00C  A0 1E 25 00                                       %.
	emu_memory_write_dword(mem,0x7ffdf00c,0x00251ea0);

//  004170A4   8B70 1C          MOV ESI,DWORD PTR DS:[EAX+1C]
//  00251EBC  58 1F 25 00                                      X%.
//	emu_memory_write_dword(mem,0x00251ebc,0x00251f58);


//	004170A7   AD               LODS DWORD PTR DS:[ESI]
//  00251F58  20 20 25 00                                        %.
//	emu_memory_write_dword(mem,0x00251f58,0x00252020);


//	004170A8   8B40 08          MOV EAX,DWORD PTR DS:[EAX+8]             ; kernel32.7C800000
//  00252028  00 00 80 7C     
//	emu_memory_write_dword(mem,0x00252028,0x7C800000);


	// http://www.nirsoft.net/kernel_struct/vista/UNICODE_STRING.html
	typedef struct _UNICODE_STRING
	{
		uint16_t Length;
		uint16_t MaximumLength;
		uint32_t Buffer;
	} UNICODE_STRING, *PUNICODE_STRING;

	// PEB_LDR_DATA Structure
	// http://msdn.microsoft.com/en-us/library/aa813708%28VS.85%29.aspx
	typedef struct _LIST_ENTRY
	{
//		struct _LIST_ENTRY *Flink;  
		uint32_t Flink;
		uint32_t Blink;
//		struct _LIST_ENTRY *Blink;
	} LIST_ENTRY, *PLIST_ENTRY; //, *RESTRICTED_POINTER PRLIST_ENTRY;

    typedef uint32_t PVOID;
	typedef unsigned char BYTE;
	typedef uint32_t ULONG;

	typedef struct _LDR_DATA_TABLE_ENTRY
	{
		/* 0x00 */ LIST_ENTRY InLoadOrderLinks;
		/* 0x08 */ LIST_ENTRY InMemoryOrderLinks;
		/* 0x10 */ LIST_ENTRY InInitializationOrderLinks;
		/* 0x18 */ uint32_t DllBase;
		/* 0x1c */ uint32_t EntryPoint;
		/* 0x1f */ uint32_t Reserved;           
		/* 0x24 */ UNICODE_STRING FullDllName;
		/* 0x2c */ UNICODE_STRING BaseDllName;
		/* 0x30 */ uint32_t Reserved5[3];
		union
		{
			ULONG CheckSum;
			PVOID Reserved6;
		};
		uint32_t TimeDateStamp;
	} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;


	// http://www.nirsoft.net/kernel_struct/vista/PEB_LDR_DATA.html
	typedef struct _PEB_LDR_DATA
	{
		 /* 0x00 */ uint32_t Length;
		 /* 0x04 */ uint8_t Initialized[4];
		 /* 0x08 */ uint32_t SsHandle;
		 /* 0x0c */ LIST_ENTRY InLoadOrderModuleList;
		 /* 0x14 */ LIST_ENTRY InMemoryOrderModuleList;
		 /* 0x1c */ LIST_ENTRY InInitializationOrderModuleList;
		 /* 0x24 */ uint8_t EntryInProgress;
	} PEB_LDR_DATA, *PPEB_LDR_DATA;

	struct _PEB_LDR_DATA peb_ldr_data;
	peb_ldr_data.InMemoryOrderModuleList.Flink = 0x00251ea0 + 0x1000 + offsetof(struct _LDR_DATA_TABLE_ENTRY, InMemoryOrderLinks);
	peb_ldr_data.InInitializationOrderModuleList.Flink = 0x00251ea0 + 0x1000 + offsetof(struct _LDR_DATA_TABLE_ENTRY, InInitializationOrderLinks);

	//printf("peb_ldr_data.InMemoryOrderModuleList.Flink = %x\n",peb_ldr_data.InMemoryOrderModuleList.Flink);

	emu_memory_write_block(mem, 0x00251ea0, &peb_ldr_data, sizeof(peb_ldr_data));

	emu_memory_write_dword(mem, 0x251eac, 0x252ea0); //fs30+0xC+0xC -> LDR_DATA_TABLES //dzzie (shellcoders handbook example)

	uint32_t magic_offset = 0x00251ea0+0x1000;

	struct _LDR_DATA_TABLE_ENTRY tables[16];
	memset(tables, 0, sizeof(tables));

	char names[16][64];
	memset(names, 0, sizeof(names));

	int i;
	//should this be set to i=1 because of peb dummy entry? - no breaks all - dzzie
